joristork/robots/jobot_in_c/microchip_extras/h/p18f65k80.h
extern volatile far  unsigned char       SDFLC;
extern volatile far  union {
  struct {
    unsigned FLC:5;
  };
  struct {
    unsigned FLC0:1;
    unsigned FLC1:1;
    unsigned FLC2:1;
    unsigned FLC3:1;
    unsigned FLC4:1;
  };
} SDFLCbits;
extern volatile far  unsigned char       RXFBCON0;
extern volatile far  union {
  struct {
    unsigned F0BP:4;
    unsigned F1BP:4;
  };
  struct {
    unsigned F0BP_0:1;
    unsigned F0BP_1:1;
    unsigned F0BP_2:1;
    unsigned F0BP_3:1;
    unsigned F1BP_0:1;
    unsigned F1BP_1:1;
    unsigned F1BP_2:1;
    unsigned F1BP_3:1;
  };
} RXFBCON0bits;
extern volatile far  unsigned char       RXFBCON1;
extern volatile far  union {
  struct {
    unsigned F2BP:4;
    unsigned F3BP:4;
  };
  struct {
    unsigned F2BP_0:1;
    unsigned F2BP_1:1;
    unsigned F2BP_2:1;
    unsigned F2BP_3:1;
    unsigned F3BP_0:1;
    unsigned F3BP_1:1;
    unsigned F3BP_2:1;
    unsigned F3BP_3:1;
  };
} RXFBCON1bits;
extern volatile far  unsigned char       RXFBCON2;
extern volatile far  union {
  struct {
    unsigned F4BP:4;
    unsigned F5BP:4;
  };
  struct {
    unsigned F4BP_0:1;
    unsigned F4BP_1:1;
    unsigned F4BP_2:1;
    unsigned F4BP_3:1;
    unsigned F5BP_0:1;
    unsigned F5BP_1:1;
    unsigned F5BP_2:1;
    unsigned F5BP_3:1;
  };
} RXFBCON2bits;
extern volatile far  unsigned char       RXFBCON3;
extern volatile far  union {
  struct {
    unsigned F6BP:4;
    unsigned F7BP:4;
  };
  struct {
    unsigned F6BP_0:1;
    unsigned F6BP_1:1;
    unsigned F6BP_2:1;
    unsigned F6BP_3:1;
    unsigned F7BP_0:1;
    unsigned F7BP_1:1;
    unsigned F7BP_2:1;
    unsigned F7BP_3:1;
  };
} RXFBCON3bits;
extern volatile far  unsigned char       RXFBCON4;
extern volatile far  union {
  struct {
    unsigned F8BP:4;
    unsigned F9BP:4;
  };
  struct {
    unsigned F8BP_0:1;
    unsigned F8BP_1:1;
    unsigned F8BP_2:1;
    unsigned F8BP_3:1;
    unsigned F9BP_0:1;
    unsigned F9BP_1:1;
    unsigned F9BP_2:1;
    unsigned F9BP_3:1;
  };
} RXFBCON4bits;
extern volatile far  unsigned char       RXFBCON5;
extern volatile far  union {
  struct {
    unsigned F10BP:4;
    unsigned F11BP:4;
  };
  struct {
    unsigned F10BP_0:1;
    unsigned F10BP_1:1;
    unsigned F10BP_2:1;
    unsigned F10BP_3:1;
    unsigned F11BP_0:1;
    unsigned F11BP_1:1;
    unsigned F11BP_2:1;
    unsigned F11BP_3:1;
  };
} RXFBCON5bits;
extern volatile far  unsigned char       RXFBCON6;
extern volatile far  union {
  struct {
    unsigned F12BP:4;
    unsigned F13BP:4;
  };
  struct {
    unsigned F12BP_0:1;
    unsigned F12BP_1:1;
    unsigned F12BP_2:1;
    unsigned F12BP_3:1;
    unsigned F13BP_0:1;
    unsigned F13BP_1:1;
    unsigned F13BP_2:1;
    unsigned F13BP_3:1;
  };
} RXFBCON6bits;
extern volatile far  unsigned char       RXFBCON7;
extern volatile far  union {
  struct {
    unsigned F14BP:4;
    unsigned F15BP:4;
  };
  struct {
    unsigned F14BP_0:1;
    unsigned F14BP_1:1;
    unsigned F14BP_2:1;
    unsigned F14BP_3:1;
    unsigned F15BP_0:1;
    unsigned F15BP_1:1;
    unsigned F15BP_2:1;
    unsigned F15BP_3:1;
  };
} RXFBCON7bits;
extern volatile far  unsigned char       MSEL0;
extern volatile far  union {
  struct {
    unsigned FIL0:2;
    unsigned FIL1:2;
    unsigned FIL2:2;
    unsigned FIL3:2;
  };
  struct {
    unsigned FIL0_0:1;
    unsigned FIL0_1:1;
    unsigned FIL1_0:1;
    unsigned FIL1_1:1;
    unsigned FIL2_0:1;
    unsigned FIL2_1:1;
    unsigned FIL3_0:1;
    unsigned FIL3_1:1;
  };
} MSEL0bits;
extern volatile far  unsigned char       MSEL1;
extern volatile far  union {
  struct {
    unsigned FIL4:2;
    unsigned FIL5:2;
    unsigned FIL6:2;
    unsigned FIL7:2;
  };
  struct {
    unsigned FIL4_0:1;
    unsigned FIL4_1:1;
    unsigned FIL5_0:1;
    unsigned FIL5_1:1;
    unsigned FIL6_0:1;
    unsigned FIL6_1:1;
    unsigned FIL7_0:1;
    unsigned FIL7_1:1;
  };
} MSEL1bits;
extern volatile far  unsigned char       MSEL2;
extern volatile far  union {
  struct {
    unsigned FIL8:2;
    unsigned FIL9:2;
    unsigned FIL10:2;
    unsigned FIL11:2;
  };
  struct {
    unsigned FIL8_0:1;
    unsigned FIL8_1:1;
    unsigned FIL9_0:1;
    unsigned FIL9_1:1;
    unsigned FIL10_0:1;
    unsigned FIL10_1:1;
    unsigned FIL11_0:1;
    unsigned FIL11_1:1;
  };
} MSEL2bits;
extern volatile far  unsigned char       MSEL3;
extern volatile far  union {
  struct {
    unsigned FIL12:2;
    unsigned FIL13:2;
    unsigned FIL14:2;
    unsigned FIL15:2;
  };
  struct {
    unsigned FIL12_0:1;
    unsigned FIL12_1:1;
    unsigned FIL13_0:1;
    unsigned FIL13_1:1;
    unsigned FIL14_0:1;
    unsigned FIL14_1:1;
    unsigned FIL15_0:1;
    unsigned FIL15_1:1;
  };
} MSEL3bits;
extern volatile far  unsigned char       BSEL0;
extern volatile far  struct {
  unsigned :2;
  unsigned B0TXEN:1;
  unsigned B1TXEN:1;
  unsigned B2TXEN:1;
  unsigned B3TXEN:1;
  unsigned B4TXEN:1;
  unsigned B5TXEN:1;
} BSEL0bits;
extern volatile far  unsigned char       BIE0;
extern volatile far  struct {
  unsigned RXB0IE:1;
  unsigned RXB1IE:1;
  unsigned B0IE:1;
  unsigned B1IE:1;
  unsigned B2IE:1;
  unsigned B3IE:1;
  unsigned B4IE:1;
  unsigned B5IE:1;
} BIE0bits;
extern volatile far  unsigned char       TXBIE;
extern volatile far  struct {
  unsigned :2;
  unsigned TXB0IE:1;
  unsigned TXB1IE:1;
  unsigned TXB2IE:1;
} TXBIEbits;
extern volatile far  unsigned char       B0CON;
extern volatile far  union {
  struct {
    unsigned FILHIT0_TXPRI0:1;
    unsigned FILHIT1_TXPRI1:1;
    unsigned FILHIT2_RTREN:1;
    unsigned FILHIT3_TXREQ:1;
    unsigned FILHIT4_TXERR:1;
    unsigned RXRTRRO_TXLARB:1;
    unsigned RXM1_TXABT:1;
    unsigned RXFUL_TXBIF:1;
  };
  struct {
    unsigned FILHIT0:1;
    unsigned FILHIT1:1;
    unsigned FILHIT2:1;
    unsigned FILHIT3:1;
    unsigned FILHIT4:1;
    unsigned RXRTRRO:1;
    unsigned RXM1:1;
    unsigned RXFUL:1;
  };
  struct {
    unsigned TXPRI0:1;
    unsigned TXPRI1:1;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABT:1;
    unsigned TXBIF:1;
  };
} B0CONbits;
extern volatile far  unsigned char       B0SIDH;
extern volatile far  union {
  struct {
    unsigned SID:8;
  };
  struct {
    unsigned SID3:1;
    unsigned SID4:1;
    unsigned SID5:1;
    unsigned SID6:1;
    unsigned SID7:1;
    unsigned SID8:1;
    unsigned SID9:1;
    unsigned SID10:1;
  };
} B0SIDHbits;
extern volatile far  unsigned char       B0SIDL;
extern volatile far  union {
  struct {
    unsigned EID:2;
    unsigned :1;
    unsigned EXIDE:1;
    unsigned SRR:1;
    unsigned SID:3;
  };
  struct {
    unsigned EID16:1;
    unsigned EID17:1;
    unsigned :3;
    unsigned SID0:1;
    unsigned SID1:1;
    unsigned SID2:1;
  };
} B0SIDLbits;
